 Org-mode

** auto-indentation
Setting this variable causes auto-indentation inside org-mode src blocks
#+BEGIN_SRC emacs-lisp
(setq org-src-tab-acts-natively t
      org-src-preserve-indentation nil
      org-edit-src-content-indentation 0)
#+END_SRC

#+RESULTS:
: 0

#+BEGIN_SRC emacs-lisp

(load-library "org")
(push "/home/paul/org-mode/lisp" load-path)
(define-key org-mode-map (kbd "C-c o") 'org-open-at-point)
(define-key global-map (kbd "C-C l") 'org-store-link)

(setq org-todo-keyword-faces
      '(("TODO" . org-warning) ("WIP" . "yellow")
        ("CANCELED" . (:foreground "blue" :weight bold))
        ("DONE" . "green")))
(use-package org-bullets
  ;; :hook (org-mode org-bullets-mode)
  :init (progn
          (setq org-ellipsis "⤵")
          ;; (add-hook org-mode-hook org-bullets-mode)
          ))

(add-hook `org-mode-hook (lambda () (setq inhibit-read-only 1)
                           ;; (auto-insert-mode)
                           (wrap-region-add-wrapper "=" "=")
                           (wrap-region-add-wrapper "~" "~")
                           (wrap-region-add-wrapper "+" "+")
                           (wrap-region-add-wrapper "/" "/")
                           (wrap-region-add-wrapper "*" "*")
                           (wrap-region-add-wrapper "_" "_")
                           (wrap-region-add-wrapper "|" "|")
                           ;; (modify-syntax-entry ?= "\"")
                           (modify-syntax-entry ?* "\"")
                           ;; (modify-syntax-entry ?_ "\"")
                           (modify-syntax-entry ?| "\"")
                           (org-bullets-mode)
                           ))

;; (defadvice syntax-table (before in-src activate)
;;   (if (org-in-src-block-p)
;;       (message "HEERE")
;;     (setq-local syntax-table python-mode-syntax-table)
;;     (setq-local syntax-table (syntax-table))))

;; (define-key org-mode-map "\C-\M-f" '(lambda ()
;;                                      (interactive)
;;                                      (if (org-in-src-block-p)
;;                                          (with-syntax-table
;;                                              python-mode-syntax-table
;;                                            (forward-sexp))
;;                                        (forward-sexp)
;;                                            )))

;; (setq prettify-symbols-alist
;; (prettify-utils-generate (("\\mathbb{N}" "ℕ"))))
;; (add-hook `org-mode-hook (lambda ()
;; (setq prettify-symbols-alist '(("\\models" .  "⊧") ("\\vdash" .  "⊢")
;;                                ("\\bar{a}"  . "a̅") ("\\underbrace"  . "a⃗")
;;                                ("\\subseteq"  . "⊆")))
;; (prettify-symbols-mode)))
;; (add-hook 'global-prettify-symbols-mode (lambda ()
;; (setq prettify-symbols-alist '(("\\models" .  "⊧") ("\\vdash" .  "⊢")
;; ("\\bar{a}"  . "a̅") ("\\underbrace"  . "a⃗")
;; ("\\subseteq"  . "⊆")))

;; ))
;; (add-hook 'org-mode-hook (org-bullets-mode))

;; (add-hook 'org-mode-hook org-bullets-mode)


;; Org babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 (mapcar (lambda (m) (cons m t))
         '(;; C calc dot
           emacs-lisp ;; gnuplot java js latex
           ;; lisp
           python ipython
           latex
           ;; R racket  not necessary for my purposes
           ;; ruby scheme
           shell sqlite ;; haskell
           sql)))
(defun my-org-confirm-babel-evaluate (lang body)
  (not (member lang '("ipython" "python" "emacs-lisp" "sh"))))

(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
;; (use-package ox-latex
;;   :config (push '(racket "Racket") org-latex-listings-langs))

;; (push '("https" . "i.reddituploads.com") org-html-inline-image-rules)
;;   (require 'ob-ipython)
;; (use-package ob-ipython :ensure t)
(require 'package)
;; (add-to-list 'package-archives
;;                  '("melpa" . "https://melpa.org/packages/"))
#+END_SRC

#+RESULTS:
: package

#+RESULTS:

*** Sql mode related

#+BEGIN_SRC emacs-lisp
;; (package-initialize)
;;   (require 'ob-sql-mode)
#+END_SRC

#+RESULTS:

Code beautifier (see https://www.emacswiki.org/emacs/SqlBeautify)
#+BEGIN_SRC emacs-lisp
(defun sql-beautify-region (beg end)
  "Beautify SQL in region between beg and END."
  (interactive "r")
  (save-excursion
    (shell-command-on-region beg end "anbt-sql-formatter" nil t)))
    ;; change sqlbeautify to anbt-sql-formatter if you
    ;;ended up using the ruby gem

(defun sql-beautify-buffer ()
 "Beautify SQL in buffer."
 (interactive)
 (sql-beautify-region (point-min) (point-max)))

(define-advice org-edit-src-exit (:before (&rest _args) format-sql)
  "Run `blacken-buffer' when leaving an org-mode Python source block."
  (when (eq major-mode 'sql-mode)
    (sql-beautify-buffer)))

#+END_SRC

#+RESULTS:
: org-edit-src-exit@format-sql

This is to remove the angle brackets from time stamps exported to html and tex.
Look into more information on beautification [[https://stackoverflow.com/a/33716338/3414663][here]]

#+BEGIN_SRC emacs-lisp
(defun org-export-filter-timestamp-remove-brackets (timestamp backend info)
  "removes relevant brackets from a timestamp"
  (cond
   ((org-export-derived-backend-p backend 'latex)
    (replace-regexp-in-string "[<>]\\|[][]" "" timestamp))
   ((org-export-derived-backend-p backend 'html)
    (replace-regexp-in-string "&[lg]t;\\|[][]" "" timestamp))))

(eval-after-load 'ox '(add-to-list
                       'org-export-filter-timestamp-functions
                       'org-export-filter-timestamp-remove-brackets))
#+END_SRC

#+RESULTS:
| org-export-filter-timestamp-remove-brackets |

* Exporting
#+BEGIN_SRC emacs-lisp
(setq org-latex-inline-image-rules '(("file" . "\\.\\(pdf\\|jpeg\\|jpg\\|png\\|ps\\|eps\\|tikz\\|pgf\\|svg\\|gif\\)\\'")))
#+END_SRC

#+RESULTS:
: ((file . \.\(pdf\|jpeg\|jpg\|png\|ps\|eps\|tikz\|pgf\|svg\|gif\)\'))

#+begin_src emacs-lisp
;; (require 'org-tempo)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
;; (add-to-list 'load-path "/home/paul/.emacs.d/ox-ipynb")
;; (require 'ox-ipynb)
#+end_src

#+RESULTS:
: ox-ipynb
